# Heroes of Pymoli: In-Game Purchase Insights

## Trends

Three observable trends based on the data

## Analysis

In [1]:
# Dependencies
import pandas as pd

In [2]:
# Load csv file
purchases_csv = "Resources/purchase_data.csv"

# Read csv and store in DataFrame
purchases_df = pd.read_csv(purchases_csv)
purchases_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [3]:
purchases_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 780 entries, 0 to 779
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Purchase ID  780 non-null    int64
 1   SN           780 non-null    object
 2   Age          780 non-null    int64
 3   Gender       780 non-null    object
 4   Item ID      780 non-null    int64
 5   Item Name    780 non-null    object
 6   Price        780 non-null    float64
dtypes: float64(1), int64(3), object(3)
memory usage: 42.8+ KB

In [4]:
purchases_df.describe()

       Purchase ID         Age     Item ID       Price
count   780.000000  780.000000  780.000000  780.000000
mean    389.500000   22.714103   91.755128    3.050987
std     225.310896    6.659444   52.697702    1.169549
min       0.000000    7.000000    0.000000    1.000000
25%     194.750000   20.000000   47.750000    1.980000
50%     389.500000   22.000000   92.000000    3.150000
75%     584.250000   25.000000  138.000000    4.080000
max     779.000000   45.000000  183.000000    4.990000

## Player count

Total number of players = 576

In [5]:
# Number of unique player names in SN column = total number of players
total_unique_players = purchases_df["SN"].nunique()
total_unique_players

576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.
* Create a summary data frame to hold the results
* Optional: give the displayed data cleaner formatting
* Display the summary data frame

In [6]:
# Unique values in Item ID column provides number of unique items purchased

unique_items = purchases_df["Item ID"].nunique()
unique_items

179

In [7]:
# Mean of price column = average price
average_price = purchases_df["Price"].mean()
average_price

3.050987179487176

In [8]:
# Count of purchase ID = total number of purchases
total_purchases = purchases_df["Purchase ID"].count()
total_purchases

780

In [9]:
# Sum of price column = total revenue
total_revenue = purchases_df["Price"].sum()
total_revenue

2379.77

In [10]:
# Create a DataFrame of summary data
summary_df = pd.DataFrame({"Total unique players": [total_unique_players],"Unique items": [unique_items],
                           "Average price": [average_price],
                           "Total purchases": [total_purchases],
                          "Total revenue": [total_revenue]}).round(2)

#Print summary Data Frame
summary_df

,Total unique players,Unique items,Average price,Total purchases,Total revenue
0,576,179,3.05,780,2379.77

# Gender Demographics

* Percentage and Count of Male Players<br>
* Percentage and Count of Female Players<br>
* Percentage and Count of Other / Non-Disclosed

In [11]:
# Pivot table to obtain data grouped by players and genders
gender_grouped_df = pd.pivot_table(data=purchases_df,index=['SN','Gender'])
gender_grouped_df = gender_grouped_df.reset_index()
gender_grouped_df

                SN  Gender  Age     Item ID     Price  Purchase ID
0     Adairialis76    Male   16  123.000000  2.280000   467.000000
1      Adastirin33  Female   35  175.000000  4.480000   142.000000
2           Aeda94    Male   17  128.000000  4.910000   388.000000
3           Aela59    Male   21  119.000000  4.320000    28.000000
4        Aelaria33    Male   23  171.000000  1.790000   630.000000
..             ...     ...  ...         ...       ...          ...
571     Yathecal82  Female   20   80.333333  2.073333   466.666667
572     Yathedeu43    Male   22   71.500000  3.010000   344.000000
573  Yoishirrala98  Female   17  145.000000  4.580000   572.000000
574     Zhisrisu83    Male   10   42.500000  3.945000    97.500000
575      Zontibe81    Male   21   82.333333  2.676667   339.666667

[576 rows x 6 columns]

In [12]:
# Calculate and store gender counts
gender_counts = gender_grouped_df["Gender"].value_counts()
gender_counts

Male                     484
Female                    81
Other / Non-Disclosed     11
Name: Gender, dtype: int64

In [13]:
# Calculate and store gender percentages
gender_percentage = gender_grouped_df["Gender"].value_counts(normalize=True)
gender_percentage

Male                     0.840278
Female                   0.140625
Other / Non-Disclosed    0.019097
Name: Gender, dtype: float64

In [14]:
# Create a new Data Frame containing gender counts and percentages
gender_demo_df = pd.DataFrame({"Total count": gender_counts,"Percentage of players": gender_percentage}).round(2)
# Print the gender demographics Data Frame
gender_demo_df

                       Total count  Percentage of players
Male                           484                   0.84
Female                          81                   0.14
Other / Non-Disclosed           11                   0.02

## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [15]:
# purchase_count = purchases_df.groupby(["Gender"])["Price"].count()
# purchase_count

In [16]:
# average_purchase_price = purchases_df.groupby(["Gender"])["Price"].mean()
# average_purchase_price

In [17]:
# total_purchase_value = purchases_df.groupby(["Gender"])["Price"].sum()
# total_purchase_value

In [18]:
# Instead of separate calculations for each variable, use aggregation function to find purchase count, average purchase price and total purchase volume
purchasing_analysis_gender_agg = purchases_df.groupby(["Gender"]).agg({"Price": ["count", "mean",sum]})
# Rename columns
purchasing_analysis_gender_agg.columns=["Purchase Count","Average Purchase Price","Total Purchase Value"]
# purchasing_analysis_gender_agg

In [19]:
# Add a new column to the Data Frame for average total purchase per person i.e. total purchase value/purchase count
# average_purchase_pp = purchasing_analysis_gender_agg["Total Purchase Value"]/purchasing_analysis_gender_agg["Purchase Count"]
# average_purchase_pp
average_purchase_pp = purchasing_analysis_gender_agg["Total Purchase Value"]/gender_counts
purchasing_analysis_gender_agg["Avg Total Purchase per Person"] = average_purchase_pp

# Print the purchasing analysis (gender) Data Frame
purchasing_analysis_gender_agg.round(2)

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Female,113,3.20,361.94,4.47
Male,652,3.02,1967.64,4.07
Other / Non-Disclosed,15,3.35,50.19,4.56

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [23]:
# Create bins based on age ranges
bins = [0, 10, 14, 19, 24, 29, 34, 39, 99]

# Name the bins
age_groups = ["<10", "10-14", "15-19", "20-24", "25-29","30-34","35-39","40+"]

In [24]:
# Identify the correct bin (i.e. age range) for each player
pd.cut(purchases_df["Age"], bins, labels=age_groups)

# Create a list of age groups for each player
age_groups_list = pd.cut(purchases_df["Age"], bins, labels=age_groups)
age_groups_list = pd.DataFrame({"Age range": age_groups_list})
# age_groups_list
# Add the age groups list to the purchases data
purchases_agerange_df = pd.concat([purchases_df,age_groups_list],axis=1)
purchases_agerange_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age range
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [25]:
# Rearrange columns
purchases_agerange_df = purchases_agerange_df[["Purchase ID","SN","Age","Age range","Gender","Item ID","Item Name", "Price"]]
purchases_agerange_df.head()

,Purchase ID,SN,Age,Age range,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,20-24,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,40+,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,20-24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,20-24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,20-24,Male,131,Fury,1.44

In [26]:
# Pivot table to obtain data grouped by age
age_grouped_df = pd.pivot_table(data=purchases_agerange_df,index=["SN","Age range"])
age_grouped_df = age_grouped_df
age_grouped_df.info()

<class 'pandas.core.frame.DataFrame'>
MultiIndex: 576 entries, ('Adairialis76', '15-19') to ('Zontibe81', '20-24')
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Age          576 non-null    int64
 1   Item ID      576 non-null    float64
 2   Price        576 non-null    float64
 3   Purchase ID  576 non-null    float64
dtypes: float64(3), int64(1)
memory usage: 24.7+ KB

In [27]:
# This includes duplicate values in SN column

test_df = purchases_agerange_df.groupby(["Age range"]).agg({"Price": ["count", "mean",sum]})
test_df

          Price
          count      mean      sum
Age range
<10          32  3.405000   108.96
10-14        19  2.681579    50.95
15-19       136  3.035956   412.89
20-24       365  3.052219  1114.06
25-29       101  2.900990   293.00
30-34        73  2.931507   214.00
35-39        41  3.601707   147.67
40+          13  2.941538    38.24

In [28]:
age_counts = purchases_agerange_df["Age range"].value_counts()
age_counts

20-24    365
15-19    136
25-29    101
30-34     73
35-39     41
<10       32
10-14     19
40+       13
Name: Age range, dtype: int64

In [29]:
# Group and aggregate
purchasing_analysis_age_agg = age_grouped_df.groupby(["Age range"]).agg({"Price": ["count", "mean",sum]})
# Rename columns
purchasing_analysis_age_agg.columns=["Purchase count", "Average Purchase Price","Total Purchase Value"]
#Print Data Frame
purchasing_analysis_age_agg.round(2)

           Purchase count  Average Purchase Price  Total Purchase Value
Age range
<10                    24                    3.52                 84.49
10-14                  15                    2.78                 41.77
15-19                 107                    3.07                328.84
20-24                 258                    3.03                782.45
25-29                  77                    2.83                218.12
30-34                  52                    2.94                152.95
35-39                  31                    3.56                110.25
40+                    12                    2.97                 35.64

In [30]:
# Add a new column to the Data Frame for average total purchase per person i.e. total purchase value/purchase count

average_purchase_pp_age = purchasing_analysis_age_agg["Total Purchase Value"]/10
purchasing_analysis_age_agg["Avg Total Purchase per Person"] = average_purchase_pp_age


# Print the purchasing analysis (age) Data Frame
purchasing_analysis_age_agg.round(2)

,Purchase count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Age range,,,,
<10,24,3.52,84.49,8.45
10-14,15,2.78,41.77,4.18
15-19,107,3.07,328.84,32.88
20-24,258,3.03,782.45,78.25
25-29,77,2.83,218.12,21.81
30-34,52,2.94,152.95,15.30
35-39,31,3.56,110.25,11.03
40+,12,2.97,35.64,3.56

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

             Purchase Count Average Purchase Price Total Purchase Value
SN
Lisosia93                 5                  $3.79               $18.96
Idastidru52               4                  $3.86               $15.45
Chamjask73                3                  $4.61               $13.83
Iral74                    4                  $3.40               $13.62
Iskadarya95               3                  $4.37               $13.10

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,$4.61,$59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
145,Fiery Glass Crusader,9,$4.58,$41.22
132,Persuasion,9,$3.22,$28.99
108,"Extraction, Quickblade Of Trembling Hands",9,$3.53,$31.77

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,$4.61,$59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
82,Nirvana,9,$4.90,$44.10
145,Fiery Glass Crusader,9,$4.58,$41.22
103,Singed Scalpel,8,$4.35,$34.80